Tekla.Structures.Plugins.PositionTypeAttribute
The PositionTypeAttribute class is used for storing the position type of the connection.
Based on the type the system will then position the connection in the creation.
The attribute is initialized from the custom attribute
[PositionType(PositionTypeEnum.COLLISION_PLANE)]
in the connection source.

Tekla.Structures.Plugins.PositionTypeAttribute.#ctor(Tekla.Structures.PositionTypeEnum)
The custom attribute [PositionType()] uses this to store the position type to the system.
This is not to be used by itself.
Type: The position type.

Tekla.Structures.Plugins.PositionTypeAttribute.Type
The custom attribute [PositionType()] uses this to store the position type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.PositionTypeAttribute.#ctor(System.Int32)
The custom attribute [PositionType()] uses this to store the position type to the system.
This is not to be used by itself.
Type: The position type.